app/Controllers/Games.php

    public function index()
    {
        $model = new Game();
        $data = $model->findAll();
---
SELECT *
FROM `games`