app/Controllers/Movies.php

SELECT *
FROM `movies`
---
    public function index()
    {
        $model = new Movie();
        $data = $model->findAll();

SELECT *
FROM `movies`
WHERE `movies`.`id` = '1'
---
    public function show($id = null)
    {
        $model = new Movie();
        $data = $model->find($id);

INSERT INTO `movies` (`title`, `subtitle`, `description`, `link`, `image`) VALUES ('Star Wars: Episódio V – O Império Contra-Ataca', 'Após a destruição da Estrela da Morte, o Império passa a ver a Rebelião como uma grande ameaça e começa a procurar os seus membros por toda galáxia.', 'No outro lado da galáxia, Han Solo (Harrison Ford) e seu companheiro Chewbacca (Peter Mayhew), junto com Leia (Carrie Fisher) e C3PO (Anthony Daniels), vão até a Cidade das Nuvens para reparar a nave em que estavam. Lá, Han encontra Lando (Billy Dee Williams), um velho conhecido, que recebe todos muito bem e os convida para um jantar. Durante a refeição, os rebeldes descobrem que haviam caído em uma armadilha: antes mesmo deles chegarem, o Império já estava na Cidade das Nuvens colocando a vida de todos em risco. Apesar de estar muito longe, Luke consegue sentir que algo ruim iria acontecer com seus amigos e, então, parte para ajudá-los.', 'https://www.youtube.com/embed/wXyosVVZEYA', 'https://www.planocritico.com/wp-content/uploads/2016/12/Star-Wars_-Epis%C3%B3dio-V-%E2%80%93-O-Imp%C3%A9rio-Contra-Ataca-The-Empire-Strikes-Back-_-Irvin-Kershner.jpg')
---
    public function create()
    {
        $rules = [
            'title' => 'required',
            'subtitle' => 'required',
            'description' => 'required',
            'link' => 'required',
            'creatorId' => 'required'
        ];

        if(!$this->validate($rules))
        {
            return $this->fail($this->validator->getErrors());
        }
        else
        {
            $data = [
                'title' => $this->request->getVar('title'),
                'subtitle' => $this->request->getVar('subtitle'),
                'description' => $this->request->getVar('description'),
                'link' => $this->request->getVar('link'),
                'image' => $this->request->getVar('image'),
                'creatorId' => $this->request->getVar('creatorId')
            ];

            $model = new Movie();
            $model->save($data);