app/Controllers/Newss.php

    public function index()
    {
        $model = new News();
        $data = $model->findAll();
---
SELECT *
FROM `news`