app/Controllers/Users.php

    public function index()
    {
        $model = new User();
        $data = $model->findAll();
---
SELECT *
FROM `users`

    public function show($id = null)
    {
        $model = new User();
        $data = $model->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '5'

    public function create()
    {
        $rules = [
            'userName' => 'required',
            'userEmail' => 'required',
            'role' => 'required'
        ];

        if(!$this->validate($rules))
        {
            return $this->fail($this->validator->getErrors());
        }
        else
        {
            $data = [
                'userName' => $this->request->getVar('userName'),
                'userEmail' => $this->request->getVar('userEmail'),
                'role' => $this->request->getVar('role')
            ];

            $model = new User();
            $model->save($data);
---
INSERT INTO `users` (`userName`, `userEmail`, `role`) VALUES ('kw', 'kw@gmail.com', 'user')

    public function delete($id = null)
    {
        $model = new User();
        $userFound = $model->find($id);

        if(empty($userFound))
        {
            return $this->failNotFound('Item não encontrado');
        }
        else
        {
            $model->delete($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'
DELETE FROM `users`
WHERE `id` IN ('3')